In [113]:
import pandas as pd
import os
from sqlalchemy import create_engine, text
from glob import glob

engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()

engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

data_path = "../data/"
csv_path = os.path.join(os.path.expanduser("~"), "iCloudDrive")
one_path = os.path.join(os.path.expanduser("~"), "OneDrive","Documents","Data")
osd_path = os.path.join(os.path.expanduser("~"),"OneDrive","Documents","obsidian-git-sync","Data")
dts_path = os.path.join(os.path.expanduser("~"),"Downloads","Datasets")

data_path = "../data/"
irreg_path = "../data/irreg/"

year = 2024
quarter = 3
year, quarter

(2024, 3)

### Begin of Irregular quarter

### Irregular Quarter Plus 1

In [28]:
file_name   = 'P1-Stocks.csv'
input_file = irreg_path + file_name
col_names   = ['name']
data_ins = pd.read_csv(input_file, sep=',', header=None, index_col=None, names=col_names)
data_ins

      name
0      AOT
1     CITY
2      FPT
3   GVREIT
4      IRC
5     KTIS
6       MC
7    OISHI
8     PICO
9      SSC
10   TFFIF
11      UV

In [30]:
names = data_ins["name"].values.tolist()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'AOT', 'CITY', 'FPT', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV'"

In [32]:
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE name in (%s)
AND ((year = %s AND quarter <= %s + 1)
OR (year = %s - 1 AND quarter > %s + 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name'''
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE name in ('AOT', 'CITY', 'FPT', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV')
AND ((year = 2024 AND quarter <= 3 + 1)
OR (year = 2024 - 1 AND quarter > 3 + 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [34]:
df = pd.read_sql(sql, conlt)
df

  name  COUNT(*)
0  AOT         3
1   MC         3

In [36]:
file_name = 'incomplete-eps.csv'
csv_file = csv_path + file_name
df.to_csv(csv_file, index=False)

### Irregular Quarter Minus 1

In [39]:
file_name   = 'M1-Stocks.csv'
input_file = irreg_path + file_name
col_names   = ['name']
data_ins = pd.read_csv(input_file, sep=',', index_col=None)
data_ins

      name
0   AEONTS
1      BCT
2    BLAND
3      BTS
4   BTSGIF
5      EPG
6   IMPACT
7      KYE
8      LHK
9      LPF
10    MACO
11     PTL
12     SFP
13  STANLY
14    TIF1
15    TLGF
16     TMW
17      TR
18    TSTH
19     VGI

In [41]:
names = data_ins["name"].values.tolist()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI'"

In [43]:
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE name in (%s)
AND ((year = %s AND quarter <= %s - 1)
OR (year = %s - 1 AND quarter > %s - 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name'''
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE name in ('AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI')
AND ((year = 2024 AND quarter <= 3 - 1)
OR (year = 2024 - 1 AND quarter > 3 - 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [45]:
df = pd.read_sql(sql, conlt)
df

Empty DataFrame
Columns: [name, COUNT(*)]
Index: []

In [47]:
file_name = 'incomplete-eps.csv'
csv_file = csv_path + file_name
df.to_csv(csv_file, index=False)

### End of Irregular quarter

### Normal Quarter Stocks

In [51]:
irreg_files = sorted(glob('../data/irreg/*.csv'))
irreg_files

['../data/irreg\\M1-Stocks.csv', '../data/irreg\\P1-Stocks.csv']

In [53]:
col_names = ['name']
df_tmp = pd.concat((pd.read_csv(file) for file in irreg_files), ignore_index=True)
df_tmp.shape

(31, 2)

In [55]:
names = df_tmp['name'].values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan'"

In [57]:
sql = """
SELECT name, COUNT(*) AS quarters 
FROM epss 
WHERE name NOT IN (%s)
AND ((year = %s AND quarter <= %s) OR (year = %s-1 AND quarter >= %s+1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name"""
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) AS quarters
FROM epss
WHERE name NOT IN ('AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan', 'nan')
AND ((year = 2024 AND quarter <= 3) OR (year = 2024-1 AND quarter >= 3+1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [59]:
df = pd.read_sql(sql, conlt)
df

   name  quarters
0  STEC         3

In [41]:
file_name = 'incomplete-eps.csv'
csv_file = csv_path + file_name
df.to_csv(csv_file, index=False)

### End of Normal Quarter stocks

### New stocks with less than 4 quarters EPS

In [63]:
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE (year = %s AND quarter <= %s) 
OR (year = %s-1 AND quarter > %s)
GROUP BY name 
HAVING MAX(quarter) < 4 
ORDER BY name'''
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE (year = 2024 AND quarter <= 3)
OR (year = 2024-1 AND quarter > 3)
GROUP BY name
HAVING MAX(quarter) < 4
ORDER BY name

In [65]:
df_tmp = pd.read_sql(sql, conlt)
df_tmp

Empty DataFrame
Columns: [name, COUNT(*)]
Index: []

### Delete EPSS record that unmatch with Tickers in PortPg

In [80]:
sql = ("SELECT * FROM epss E WHERE E.ticker_id NOT IN (SELECT id FROM tickers)")
df = pd.read_sql(sql, conpg)
df.shape

(0, 14)

In [84]:
sql = '''
SELECT *
FROM epss
'''
epss = pd.read_sql(sql, conlt)
epss.shape

(9240, 14)

In [86]:
sql = '''
SELECT *
FROM tickers
'''
tickers = pd.read_sql(sql, conpg)
tickers.shape

(396, 9)

In [88]:
df_merge = pd.merge(epss, tickers, on='name', how='outer', indicator = True)
df_merge.shape

(9410, 23)

In [90]:
df_left = df_merge[df_merge['_merge'] == 'left_only']
df_left

Empty DataFrame
Columns: [id_x, name, year, quarter, q_amt, y_amt, aq_amt, ay_amt, q_eps, y_eps, aq_eps, ay_eps, ticker_id, publish_date, id_y, full_name, sector, subsector, market, website, created_at, updated_at, _merge]
Index: []

[0 rows x 23 columns]

In [92]:
name_ary = df_left['name'].unique()
name_ary

array([], dtype=object)

In [94]:
sql = '''
SELECT *
FROM epss
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
errors = pd.read_sql(sql, conlt)
errors

Empty DataFrame
Columns: [id, name, year, quarter, q_amt, y_amt, aq_amt, ay_amt, q_eps, y_eps, aq_eps, ay_eps, ticker_id, publish_date]
Index: []

### Delete YR_PROFITS record that unmatch with Tickers in PortPg

In [97]:
sql = """
SELECT name, sector, subsector 
FROM tickers
"""
tickers = pd.read_sql(sql, conpg)
tickers.shape

(396, 3)

In [99]:
sql = '''
SELECT *
FROM yr_profits
'''
yr_profits = pd.read_sql(sql, conlt)
yr_profits.shape

(6740, 9)

In [101]:
df_merge = pd.merge(yr_profits, tickers, on="name", how="outer", indicator=True)
df_merge.shape

(6910, 12)

In [103]:
df_left = df_merge[df_merge["_merge"] == "left_only"]
df_left.shape

(0, 12)

In [105]:
name_ary = df_left["name"].unique()
name_ary

array([], dtype=object)

In [107]:
sql = '''
SELECT *
FROM yr_profits
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
print(sql)

SELECT *
FROM yr_profits
WHERE name IN ()

In [109]:
errors = pd.read_sql(sql, conlt)
errors

Empty DataFrame
Columns: [id, name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id]
Index: []

In [115]:
sql = text('''
DELETE
FROM yr_profits
WHERE name IN (%s)
''')
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
print(sql)

TypeError: unsupported operand type(s) for %: 'TextClause' and 'str'

In [34]:
rp = conlt.execute(sql)
rp.rowcount

0

In [133]:
name_ary = df_left["name"].unique()

# Check if name_ary is empty/null
if len(name_ary) == 0:
    print("No names to delete - name_ary is empty")
else:
    # SQLAlchemy uses parameterized queries differently
    placeholders = ', '.join([':' + str(i) for i in range(len(name_ary))])
    query = f"DELETE FROM yr_profits WHERE name IN ({placeholders})"

    # Create parameters dictionary
    params = {str(i): name for i, name in enumerate(name_ary)}

    # Execute using connection directly
    result = conlt.execute(query, params)
    conlt.commit()

    print(f"Query executed: {query}")
    print(f"Number of rows deleted: {result.rowcount}")

No names to delete - name_ary is empty

### Profits table

In [35]:
pd.set_option('display.max_rows',None)
sql = '''
SELECT * 
FROM profits
ORDER BY name, year, quarter
'''
profits = pd.read_sql(sql, conmy)
profits.shape

(20, 23)

### End of Delete Profits records

In [36]:
sql = """
SELECT * 
FROM tickers
LIMIT 1"""
tickers = pd.read_sql(sql, conlt)
tickers.dtypes

id             int64
name          object
full_name     object
sector        object
subsector     object
market        object
website       object
created_at    object
updated_at    object
dtype: object

In [37]:
sql = """
SELECT DISTINCT T.sector, T.subsector
FROM profits P
JOIN tickers T ON P.ticker_id = T.id
ORDER BY T.sector, T.subsector
"""
pwc = pd.read_sql(sql, conlt)
pwc

                     sector                               subsector
0      Agro & Food Industry                         Food & Beverage
1                Financials                                 Banking
2                Financials                    Finance & Securities
3                Financials                               Insurance
4               Industrials                Steel and Metal Products
5   Property & Construction                  Construction Materials
6   Property & Construction                   Construction Services
7   Property & Construction                    Property Development
8   Property & Construction                   Property Fund & REITs
9                 Resources                      Energy & Utilities
10                 Services                                Commerce
11                 Services                    Health Care Services
12                 Services                      Media & Publishing
13                 Services              Transportation & Logistics
14               Technology  Information & Communication Technology

In [38]:
sql = """
SELECT * 
FROM consensus
LIMIT 1"""
consensus = pd.read_sql(sql, conlt)
consensus

,id,name,price,buy,hold,sell,eps_a,eps_b,pe,pbv,yield,target_price,status,ticker_id,created_at,updated_at
0,2,ADVANC,197.5,12,0,0,9.28,9.58,21.3,6.6,3.9,238,X,6,2017-07-23 09:50:15.621932,2023-01-31 03:07:34.659210

In [39]:
sql = """
SELECT P.name, year, quarter, C.buy, C.hold, C.sell
FROM profits P
JOIN tickers T ON P.ticker_id = T.id
JOIN consensus C ON C.ticker_id = T.id
ORDER BY C.buy DESC
"""
pwc = pd.read_sql(sql, conlt)
pwc

      name  year  quarter  buy  hold  sell
0      SCB  2023        4   12     0     0
1   ADVANC  2023        3   12     0     0
2   ADVANC  2024        3   12     0     0
3   ADVANC  2024        1   12     0     0
4      BBL  2023        3   10     2     0
5      KTB  2023        3   10     1     0
6     BDMS  2023        4    9     2     0
7     BDMS  2024        3    9     2     0
8      BEM  2024        3    9     1     0
9      TTB  2023        4    8     6     0
10     TTB  2023        3    8     6     0
11     PTT  2023        4    6     0     0
12   CPAXT  2023        4    6     2     1
13       M  2023        4    6     2     0
14      CK  2024        3    6     0     0
15   PLANB  2023        4    5     0     0
16   PLANB  2024        3    5     0     0
17    GPSC  2023        3    4     1     1
18   CPALL  2023        4    4     0     0
19     ILM  2023        4    4     0     0
20     CBG  2024        3    4     1     0
21     KSL  2022        2    3     1     0
22     KSL  2022        3    3     1     0
23  INTUCH  2023        4    3     2     0
24  INTUCH  2023        3    3     2     0
25  INTUCH  2024        3    3     2     0
26      BH  2024        3    3     4     1
27   SYNEX  2024        3    3     2     0
28     BCH  2024        3    3     2     0
29     CRC  2024        3    3     0     0
30     CKP  2024        3    2     0     0
31     FPT  2023        2    1     0     0
32  IMPACT  2023        3    1     0     0
33    TIPH  2023        4    1     0     0
34    SJWD  2023        4    1     1     0
35   TFFIF  2024        3    1     0     0
36     MTC  2024        3    1     1     2
37   VIBHA  2024        3    1     1     0
38   ROJNA  2024        3    1     0     0
39    GULF  2024        3    1     2     0
40  GVREIT  2021        3    0     1     0
41    LHFG  2023        3    0     1     0
42    SCCC  2023        4    0     2     0
43  EGATIF  2023        4    0     1     0
44     SPC  2023        4    0     1     0
45     RCL  2024        3    0     0     1
46     AIT  2024        3    0     1     0
47     TFG  2024        3    0     0     0

### Delete Profits records by Name

In [40]:
sql = '''
SELECT * 
FROM profits
ORDER BY name, year, quarter'''
profits = pd.read_sql(sql, conlt)
profits.shape

(57, 23)

In [41]:
names = '''
'''.split()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

''

In [42]:
sql = '''
DELETE FROM profits
WHERE name IN (%s)'''
sql = sql % in_p
print(sql)

DELETE FROM profits
WHERE name IN ()

In [43]:
rp = conlt.execute(sql)
rp.rowcount

0

### Delete profits by year

In [44]:
sql = '''
DELETE FROM profits
WHERE year = 2020'''
#sql = sql % in_p
print(sql)

DELETE FROM profits
WHERE year = 2020

In [45]:
#rp = conlt.execute(sql)
rp.rowcount

0

### End of Delete profits by year